[
  {
    "name": "GitPod",
    "url": "https://www.gitpod.io/",
    "content": "This is the current Code Institute IDE. It is cloud based and free. Looks and feels a lot like Visual Studio Code, but without the differences caused by different operating systems on your local computer. If you have a GitPod account you can easily share your live site with other students, and share your code with CI tutors if you have a problem they need to look at."
  },
  {
    "name": "Visual Studio Code",
    "url": "https://code.visualstudio.com/",
    "content": "Free. Built on open source. Runs everywhere. Locally installed on your own machine. Probably the most preferred in our community right now. Requires some additional setup not needed with a cloud based IDE. Probably a better IDE to use once you have some experience with using a cloud based one."
  },
  {
    "name": "AWS-Cloud9",
    "url": "https://aws.amazon.com/cloud9/",
    "content": "Cloud based, online, many of the current Code Institute videos were made using it. However after AWS took it over last year and changed important features it proved to be very unpopular with students, which is why Code Institute moved to the GitPod IDE"
  },
  {
    "name": "Brackets",
    "url": "http://brackets.io/",
    "content": "A modern, open source text editor that understands web design."
  },
  {
    "name": "Atom",
    "url": "https://atom.io/",
    "content": "A hackable text editor for the 21st Century, with built in Git integration."
  },
  {
    "name": "PyCharm",
    "url": "https://www.jetbrains.com/pycharm/?var=landing&gclid=Cj0KCQjwpavpBRDQARIsAPfTwiwVGAKj6BJxZPo9NYRGzvGcovt6W5L8Te42h49ZOvJZzwD2RL77BT8aAolPEALw_wcB",
    "content": "PyCharm is designed by programmers, for programmers, to provide all the tools you need for productive development (with high focus on Python."
  },
  {
    "name": "Notepad++",
    "url": "https://notepad-plus-plus.org/downloads/",
    "content": "Notepad++: a free source code editor which supports several programming languages running under the MS Windows environment."
  }
]
