[
  {
    "name": "W3Schools",
    "url": "https://www.w3schools.com/",
    "content": "W3 is an educational website for learning programming languages & frameworks, such as HTML, CSS & Bootstrap (and many more). All of which you will be using through UCFD!"
  },
  {
	  "name": "MDN Mozilla",
	  "url": "https://developer.mozilla.org/en-US/",
	  "content": "MDN Web Docs is an evolving learning platform for Web tech & the software that powers the Web, such as HTML, CSS & Javascript to name a few."
  },
  {
	  "name": "Anna Greaves' Bootstrap Grid Tutorial",
	  "url": "https://www.youtube.com/watch?v=zDpCejbl1sU&t=539s",
	  "content": "Anna Greaves, a current student on the course we are all on and my predecessor as UCFD Lead, has created an incredible resource on the Bootstrap Grid. I really think Code Institute should consider putting this video in the curriculum, as I know it has helped not only me, but many MANY other students in their understanding of how to navigate the Grid!"
  },
  {
	  "name": "Traversy Media Youtube Channel",
	  "url": "https://www.youtube.com/watch?v=yfoY53QXEnI&t=3591s",
	  "content": "For the sake of this webspace, I couldn't possibly link the thousands of videos Brad from Traversy Media has made that could possibly help us in our journey, but I have linked his Crash Course on CSS3 video for you all to sink your teeth into. (P.S: There is also a HTML5 Crash course video too.)"
  },
  {
	  "name": "Design Course Youtube Channel",
	  "url": "https://www.youtube.com/watch?v=8gNrZ4lAnAw&list=PL0lNJEnwfVVN2weA7ogzp6GlJvQlXnrSj&index=11",
	  "content": "Take a dive into the mind of a Frontend, state of the art UI Designer, again I couldn't possible link all of the useful videos he has made, but I have linked Gary's video on the 2019 Frontend Developer Crash Course (HTML & CSS)"
  },
  {
	  "name": "Markdown Cheat Sheet",
	  "url": "https://github.com/adam-p/markdown-here/wiki/Markdown-Cheatsheet",
	  "content": "This document was a godsend for me when I was writing my README.md file for my 1st milestone and I'm sure I'll be referencing it again for all the rest of my Milestone projects. The link will take you to Adam Pritchard's Github and the repo where this cheatsheet is housed!"
  },
  {
	  "name": "Jon Duckett's Reference Books",
	  "url": "http://www.htmlandcssbook.com/buy/",
	  "content": "Jon Duckett has created an inspirational set of reference material for anyone from the tech-savvy experienced coder to anyone with no coding experience. I bought these within my first week and have read them extensively! From HTML & CSS to Javascript & jQuery you are sure to use these throughout your entire course."
  },
  {
	  "name": "Bootstrap Documentation",
	  "url": "https://getbootstrap.com/",
	  "content": "If you can think of an element, Bootstrap probably has it, from responsive imagery to dynamic collapsable elements. The documentation is easy to follow and you will be using Bootstrap to structure your Milestone projects to be responsive!"
  },
  {
	  "name": "Font Awesome Iconography Documentation",
	  "url": "https://fontawesome.com/how-to-use/on-the-web/referencing-icons/basic-use",
	  "content": "Welcome to the world of Iconography! Font Awesome has a host of free icons that you can use to uplift your html elements to a more unique and eye-popping appeal. The documentation deals with start-up, linking to the website and the icons and how to style them to fit the theme/palette of your website!"
  },
  {
	  "name":
	  "url":
	  "content":
  },
  {
	  "name":
	  "url":
	  "content":
  },
  {
	  "name":
	  "url":
	  "content":
  },
  {
	  "name":
	  "url":
	  "content":
  }
]
