[
  {
    "name": "Adobe Color",
    "url": "https://color.adobe.com/create",
    "content": "The Adobe Color service helps you choose harmonious and appealing color combinations for your design projects, it even has an upload image element that takes your image through it's intuitive system and picks the color scheme for you!"
  },
 {
	 "name": "CSS Matic",
	 "url": "https://www.cssmatic.com/",
	 "content": "The CSS Matic helps you to generate a gradient color of your structure, border radius towards a circle or a rectangle, background noise texture and box shadows using CSS and providing you all the relevant toolkits to work on the different browsers!"
 },
 {
	 "name": "Color Picker",
	 "url": "http://eye-dropper.kepi.cz/",
	 "content": "This simple addition to Chrome will make your life so much easier when trying to find the color a particular site is using, made by Kepi on Github and the Color Picker that I have used for quite some time now."
 },
 {
	 "name": "HTML Validator",
	 "url": "https://validator.w3.org/#validate_by_input",
	 "content": "The gold star in terms of trying to find that missing `.` or `-` in your html markup. Any developer worth their salt, will use this tool on a regular basis to validate their code and make sure every div is closed and every element is structured correctly!"
 },
 {
	 "name": "CSS Validator",
	 "url": "https://jigsaw.w3.org/css-validator/#validate_by_input",
	 "content": "As with the HTML Validator, this CSS version ensure that you have accounted for every possible closing curly brace, every `,` comma seperated when needed. Another one of those essential tools for all developers, maintaining that tool of the trade mantra!"
 },
 {
	 "name": "Chrome DevTools",
	 "url": "https://www.youtube.com/watch?v=x4q86IjJFag",
	 "content": "Ok, so I obviously can't link you to the DevTools, but I have linked a video from Traversy Media, which is a tutorial Crash Course on how to open and use! I 100% recommend you get used to this Tool, as it is every developer's best friend."
 },
 {
	 "name": "Boostnote"
	 "url":
	 "content": "A truly distraction free, live preview, what you see is what you get Markdown Editor. Install this to your local device for a simple and effective README editor."
 },
 {
	 "name":
	 "url":
	 "content":
 },
 {
	 "name":
	 "url":
	 "content":
 },
 {
	 "name":
	 "url":
	 "content":
 },
 {
	 "name":
	 "url":
	 "content":
 },
 {
	 "name":
	 "url":
	 "content":
 },
 {
	 "name":
	 "url":
	 "content":
 },
 {
	 "name":
	 "url":
	 "content":
 },
 {
	 "name":
	 "url":
	 "content":
 },
 {
	 "name":
	 "url":
	 "content":
 },
 {
	 "name":
	 "url":
	 "content":
 },
]
